import random
from .utils import nickname

    
async def chuo_send_msg():
    # 使用 random.randint() 生成一个随机整数，作为选择消息的索引
    rand_num = random.randint(0, len(chuo_msg) - 1)  
    # 返回位于随机索引处的消息
    return chuo_msg[rand_num]

#戳一戳文案
chuo_msg = [
    f"别戳了，{nickname}怕疼QwQ",
    f"呜呜，再戳{nickname}脸都要肿了",
    f"戳坏了{nickname}，你赔得起吗？",
    f"再戳{nickname}，我要叫我主人了",
    f"别老戳{nickname}了，您歇会吧~",
    f"再戳{nickname}，咬你了嗷~",
    f"请不要戳{nickname} >_<",
    f"喂(#`O′) 戳{nickname}干嘛！",
    "想好了再戳，(*-`ω´-)✄",
    "喂，110吗，有人老戳我",
    "嗷呜嗷呜...恶龙咆哮┗|｀O′|┛",
    "有事恁叫我，别天天一个劲戳戳戳！",
    "再戳我让你变成女人，嘿嘿",
    "不要戳我了 >_<",
    "不要这样子啦(*/ω＼*)",
    "不要再戳了(害怕ing)",
    "还戳，哼(つд⊂)（生气）",
    "再戳，小心我顺着网线找你.",
    "咱要型气了o(>﹏<)o",
    "嘿嘿，好舒服呀(bushi)",
    "乖，好了好了，别戳了~",
    "我爪巴爪巴，球球别再戳了",
    "别再戳我了，行🐎？！",
    "啊呜，你有什么事吗？",
    "lsp你再戳？",
    "连个可爱美少女都要戳的肥宅真恶心啊。",
    "你再戳！",
    "？再戳试试？",
    "别戳了别戳了再戳就坏了555",
    "我爪巴爪巴，球球别再戳了",
    "你戳你🐎呢？！",
    "放手啦，不给戳QAQ",
    "戳坏了，赔钱！",
    "戳坏了",
    "嗯……不可以……啦……不要乱戳",
    "那...那里...那里不能戳...绝对...",
    "(。´・ω・)ん?",
    "有事恁叫我，别天天一个劲戳戳戳！",
    "欸很烦欸！你戳🔨呢",
    "再戳一下试试？",
    "正在关闭对您的所有服务...关闭成功",
    "啊呜，太舒服刚刚竟然睡着了。什么事？",
    "正在定位您的真实地址...定位成功。轰炸机已起飞"
    "再戳就更大了qwq"
]
